# Задача 1: Створіть змінну з текстом і виведіть її на екран за допомогою функції print.

value_text = "Value with text."
print(value_text)


# Задача 2: Створіть ще одну змінну, але вже з числом і виведіть її на екран за допомогою функції print.
value_int = 10
print(value_int)


# Задача 3: Виведіть на екран за допомогою функцій type та print тип двох змінних з задачі один та задачі два.
print(type(value_text))
print(type(value_int))