# Задача 1: Створіть функцію add_numbers(a, b, с) для додавання трьох чисел.
# Параметризуйте цю функцію для тестування з використанням pytest.param для таких випадків:
# -Додавання позитивних цілих чисел
# -Додавання від'ємного та позитивного числа
# -Додавання чисел з плавучою комою

# Задача 2: Напишіть функцію піднесення до степіння та протестуйте її використовуючи 5 тестових наборів.

# Задача 3: Напишіть функцію sum_list(numbers), яка обчислює суму елементів списку numbers.
# Параметризуйте тести для цієї функції з використанням pytest.param для різних списків чисел, включаючи пустий список.
