numbers = [5, 21, -21, 0, -2, 4, 3]

# Задача 1: Створіть програму, яка перебирає список чисел.
# Використовуючи умовний оператор, використайте команду continue, щоб пропустити обробку чисел, які менше за 0.
# Використайте команду pass для ігнорування нуля.
for number in numbers:
    if number < 0:
        continue
    if number == 0:
        pass


# Задача 2: Створіть програму, яка шукає перше число в списку, яке ділиться на 7 без остачі.
# Використовуйте цикл for та команду break, щоб зупинити перебір елементів після знаходження першого числа.
# Якщо такого числа немає то цикл має виводити повідомлення. Що числа яке націло ділиться на сім не має у списку.
for number in numbers:
    if number % 7 == 0:
        print(number)
        break
    else:
        continue
else:
    print('такого числа немає')


# Задача 3: Напишіть програму, яка використовує цикл for для перебору списку чисел.
# Пропустіть операції з числами, які дорівнюють 0 або менше. Виведіть суму всіх інших чисел.
total = 0
for number in numbers:
    if number <= 0:
        continue
    else:
        total += number
print(total)

# **Додаткові завдання:**
# Задача 4
# У вас є список слів у різному регістрі.
# * Якщо у списку є число, то ви зупиняєте роботу циклу і виводите повідомлення.
# * Якщо вам попадається слово, в якого перша буква велика, то ви нічого з ним не робите.
# * Якщо ж якийсь інший випадок, то це слово відправляєте у функцію, яка повертає вам це ж слово,
# але написане у форматі, де перша літера велика, а решта маленькі, після чого ви виводите на екран це слово.
list_of_words = ["UK", "London", "city", 221, "Baker Street"]


def word_capitalize(string):
    capitalized_word = string.capitalize()
    return capitalized_word


for word in list_of_words:
    if type(word) is type(1):
        print("Цикл закінчено.")
        break
    elif word == word.capitalize():
        continue
    else:
        result = word_capitalize(word)
        print(result)
