# Задача 1: Створіть програму, яка перебирає список чисел.
# Використовуючи умовний оператор, використайте команду continue, щоб пропустити обробку чисел, які менше за 0.
# Використайте команду pass для ігнорування нуля.
def task_1():
    numbers = [5, 4, -5, 0, -2, 4, 3]

    for number in numbers:
        if number < 0:
            pass
        else:
            continue


# Задача 2: Створіть програму, яка шукає перше число в списку, яке ділиться на 7 без остачі.
# Використовуйте цикл for та команду break, щоб зупинити перебір елементів після знаходження першого числа.
# Якщо такого числа немає то цикл має виводити повідомлення. Що числа яке націло ділиться на сім не має у списку.


# Задача 3: Напишіть програму, яка використовує цикл for для перебору списку чисел.
# Пропустіть операції з числами, які дорівнюють 0 або менше. Виведіть суму всіх інших чисел.