numbers = [5, 21, -21, 0, -2, 4, 3]

# Задача 1: Створіть програму, яка перебирає список чисел.
# Використовуючи умовний оператор, використайте команду continue, щоб пропустити обробку чисел, які менше за 0.
# Використайте команду pass для ігнорування нуля.
for number in numbers:
    if number < 0:
        pass
    else:
        continue


# Задача 2: Створіть програму, яка шукає перше число в списку, яке ділиться на 7 без остачі.
# Використовуйте цикл for та команду break, щоб зупинити перебір елементів після знаходження першого числа.
# Якщо такого числа немає то цикл має виводити повідомлення. Що числа яке націло ділиться на сім не має у списку.
for number in numbers:
    if (not (number % 7)) and (number >= 7):
        print(number)
        break
    else:
        continue
else:
    print('такого числа немає')
    # Я вірно розумію, що else після loop завжди буде відпрацьовувати, якщо немає break?


# Задача 3: Напишіть програму, яка використовує цикл for для перебору списку чисел.
# Пропустіть операції з числами, які дорівнюють 0 або менше. Виведіть суму всіх інших чисел.
total = 0
for number in numbers:
    if number <= 0:
        continue
    else:
        total += number
