# **Базові завдання: **
# Задача 1: Створіть файл pytest.ini та додайте до нього позначку "regression", "smoke" та "retest".
# -> Done!

# Задача 2: Напишіть тести, як це зроблено у відео, промаркуйте тести використовуючі ці позначкі.
# Зробіть запуск тестів, але тільки з позначкою "regression" і переконайтесь, що він виконується лише з цією позначкою.
# -> Done!

# Задача 3: На вже створених тестах зробіть запуск з позначкою "retest" та "smoke" через PyCharm
# скориставшись Additional Arguments, як це робилось у відео. Переконайтесь що проходять саме ці тести.
# -> Done!
