# Завдання для кращого розуміння матеріалу:

# Задача 1: Створіть файл з новими тестами як ми це робили у попередніх уроках.
# Спробуйте запустити ваші тести з параметром, який зупиняє виконання після першої помилки.
# Переконайтесь, що це працює правильно.

# Задача 2: Додайте тести з різними іменами із задачі один та запустіть тільки ті тести,
# що мають певне ім'я за допомогою параметра командного рядка.

# Задача 3 : Запустіть тести та згенеруйте звіт результатів у форматі, який вам зручний (наприклад, HTML або XML).
# Перегляньте звіт, щоб побачити деталі результатів ваших тестів.

def test_hometask_03_01():
    assert True


def test_hometask_03_02():
    assert False


def test_hometask_03_03():
    assert True
