# Задача 1: Напишіть три тестові функції: test_first(), test_second(), test_third().
# Використайте декоратори або для встановлення порядку виконання цих тестів.
# Наприклад, переконайтеся, що test_first() виконується перед test_second(), а test_second() - перед test_third().

# Задача 2: Створіть тести, де результат виконання одного тесту впливає на наступний.
# Наприклад, переконайтеся, що після успішного виконання test_login() виконується test_access_granted(),
# а після невдалого виконання test_login() - test_access_denied()

# Задача 3: Створіть 10 тестів  (можно взяти з другого уроку)  промаркуйте порядок виконання від 1 до 10.
# Створіть фікстуру test_data зі області видимості function та переконайтеся, що кожен тест викликає фікстуру,
# яка виводить "test start" перед тестом і "test finish" після завершення тесту.
# Підтвердіть, що тести виконуються у вірному порядку відповідно до маркерів,
# а також виводять необхідні повідомлення фікстури.
